import { nanoid } from "nanoid";

export const textData = [
    {
        id: nanoid(), header: 'Как начать тренироваться?',
        texts: [
            'Для домашних тренировок не требуется дополнительного оборудования, они удобны, поскольку вам не нужно добираться до спортивного зала. Но есть и минусы в том, что зачастую для таких тренировок отсутствует мотивация и систематичность. Что нужно сделать, чтобы тренировки дома приносили максимальную пользу и удовольствие?',
        ],
        panel: 'panel1',
        ariaControls: 'panel1d-content'
    },
    {
        id: nanoid(), header: 'Как тренироваться дома?',
        texts: [
            'Найдите достаточно места для тренировок',
            'Это может быть место в вашей спальне, гостиной или даже в коридоре. Как минимум в нем должно быть достаточно места для коврика и для того, чтобы вы могли вытягивать руки во все стороны, не задев ничего.',
        ],
        panel: 'panel2',
        ariaControls: 'panel2d-content'
    },
    {
        id: nanoid(), header: 'Планирование',
        texts: [
            'Назначайте дни и время для занятий спортом и привлекайте свое внимание к ним при помощи будильника или напоминания на смартфоне. Если у вас проблемы с мотивацией, объединитесь с членом семьи или другом. Приложения для отслеживания фитнеса или приложения для тренировок и видеоролики также могут помочь вам мотивировать себя на занятия спортом.',
            'Обратите внимание: приложение насчитывает баллы за каждуют тренировку. Если вы не занимаетесь больше 2х дней, то у вас списывается 30баллов.',
        ],
        panel: 'panel3',
        ariaControls: 'panel3d-content'
    },
    {
        id: nanoid(), header: 'Разминка',
        texts: [
            'Не забывайте про разминку и заминку',
            'Ходьба, езда на велосипеде или бег на месте — отличные варианты разминки. Легкая растяжка и ходьба на месте — хорошие способы остыть и восстановить сердечный ритм после физической нагрузки.'
        ],
        panel: 'panel4',
        ariaControls: 'panel4d-content'
    },
    {
        id: nanoid(), header: 'Используйте вес своего тела',
        texts: [
            'Упражнения с собственным весом при правильном использовании могут быть такими же эффективными для наращивания мышечной массы, как и поднятие тяжестей. Изменяя свои тренировки и увеличивая интенсивность или продолжительность с течением времени, вы получите максимальную отдачу от них.',
        ],
        panel: 'panel5',
        ariaControls: 'panel5d-content'
    },
    {
        id: nanoid(), header: 'Питание до тренировки',
        texts: [
            'При увеличении физической нагрузки усиливается сжигание активных калорий. Цели правильного питания могут быть разными: кому-то хочется похудеть, кому-то набрать мышечную массу, а кто-то хочет поправить здоровье.',
            'Для похудения необходимо добиться существенного дефицита калорий. Результаты исследований доказывают, что лишь в связке «здоровое питание — тренировки», людям действительно удается сбросить лишний вес, не теряя при этом тонуса и силы мышц. К тому же результаты такого подхода остаются с человеком на длительный срок.',
            'Так что же можно съесть перед тренировкой, чтобы процесс сжигания жира запустился и работал на вас? Если у вас нет проблем со здоровьем желудочно-кишечного тракта, то для вас доступен вариант тренировки на голодный желудок. Учтите, что такая тренировка должна быть низкоинтенсивной и не превышать по времени 40 минут. Обязательно пейте воду до и во время такой тренировки.',
            'Большинству тех, кто занимается спортом умеренной интенсивности и регулярно проводит короткие тренировки (не больше 40 минут) в течение дня, следует уделять внимание правильному водному балансу (400-600 мл за час-полтора до и 150 мл на каждые 20 минут физической активности). Но тем, кто тренируется от 30 до 60 минут, может быть полезна легкая закуска, состоящая в основном из углеводов.',
            'Если активность планируется более длительной или с высокими энергозатратами, то не стоит переживать за калорийность приема пищи, более важным аспектом здесь будет время перекуса — он должен быть не позднее одного часа до физической активности.',
        ],
        panel: 'panel6',
        ariaControls: 'panel6d-content'
    },
    {
        id: nanoid(), header: 'Питание после тренировки',
        texts: [
            'Тренировки обычно истощают гликоген. Первые 30 минут после тренировки предоставляют возможность для восстановления благодаря таким факторам, как усиление кровотока и чувствительность к инсулину. Это повышает поглощение клетками глюкозы и восстановление гликогена. Дайте мощный толчок к восстановлению вашему организму сразу после тренировки с помощью этих вариантов перекусов, богатых белком и углеводами:',
            '- Йогурт с гранолой и черникой.',
            ' -Яблоки, сухофрукты.',
            '- Арахисовое масло или миндаль.',
            '- Протеиновый коктейль.',
            'Обязательно пейте воду как можно скорее после завершения тренировки. Идеально подойдет спортивный напиток, восполняющий потерянные электролиты. Такие напитки называются «электролитные». Также подойдут изотонические напитки.',
            'Ваш следующий прием пищи через несколько часов после тренировки также должен состоять из белков и углеводов. Хотя ежедневные потребности в белке различаются у разных людей, потребление 15-25 г белка в течение одного часа после тренировки максимизирует процесс восполнения сил и восстановления мышц.',
        ],
        panel: 'panel7',
        ariaControls: 'panel7d-content'
    },
]

export const sourceLink = 'https://www.sport-express.ru/'